---
kind: type
id: T:Autodesk.Revit.DB.AdaptivePointType
source: html/a766bd98-92b6-ea2f-2544-94acca1ad268.htm
---
# Autodesk.Revit.DB.AdaptivePointType

An enumerated type containing possible types for Adaptive Points.

## Syntax (C#)
```csharp
public enum AdaptivePointType
```